//==+====1====+====2====+====3====+====4====+====5====+====6====+====7====+====8====+====9====+====0
// RP2040用 定義
//==+====1====+====2====+====3====+====4====+====5====+====6====+====7====+====8====+====9====+====0
// リセットボタンをダブルタップすることでブートローダーモードをアクティブ化する
#define RP2040_BOOTLOADER_DOUBLE_TAP_RESET
// リセットボタンのダブルタップのタイムアウト（200ms）
#define RP2040_BOOTLOADER_DOUBLE_TAP_RESET_TIMEOUT 200U

// 分割キーボードの識別タイムアウト（7秒/デフォルト2秒）
#define SPLIT_USB_TIMEOUT 7000 //Default 2000
// 分割キーボードの識別インターバル（25ms/デフォルト10ms）
#define SPLIT_USB_TIMEOUT_POLL 25

//==+====1====+====2====+====3====+====4====+====5====+====6====+====7====+====8====+====9====+====0
// Vial用 定義
//==+====1====+====2====+====3====+====4====+====5====+====6====+====7====+====8====+====9====+====0
// キーボードのUIDを指定
#define VIAL_KEYBOARD_UID {0xAD, 0x42, 0xC2, 0xA6, 0xB8, 0x86, 0xA4, 0x65}
// Vialのロック解除キーコンボの指定
#define VIAL_UNLOCK_COMBO_ROWS {0, 0}
#define VIAL_UNLOCK_COMBO_COLS {0, 1}
